{"modelTopology": {"backend": "tensorflow", "training_config": {"sample_weight_mode": null, "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "learning_rate": 0.0010000000474974513, "amsgrad": false, "decay": 0.0}}, "weighted_metrics": null, "loss": "categorical_crossentropy"}, "keras_version": "2.2.4-tf", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Model", "config": {"name": "mobilenetv2_1.00_224", "output_layers": [["out_relu", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3]}}, {"name": "Conv1_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "Conv1_pad", "padding": [[0, 1], [0, 1]], "trainable": false, "dtype": "float32", "data_format": "channels_last"}}, {"name": "Conv1", "class_name": "Conv2D", "inbound_nodes": [[["Conv1_pad", 0, 0, {}]]], "config": {"padding": "valid", "filters": 32, "strides": [2, 2], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "name": "Conv1", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "bn_Conv1", "class_name": "BatchNormalization", "inbound_nodes": [[["Conv1", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "bn_Conv1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "Conv1_relu", "class_name": "ReLU", "inbound_nodes": [[["bn_Conv1", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "Conv1_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "expanded_conv_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["Conv1_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "expanded_conv_depthwise", "activity_regularizer": null, "activation": "linear", "trainable": false, "depthwise_regularizer": null, "depthwise_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "data_format": "channels_last"}}, {"name": "expanded_conv_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "expanded_conv_depthwise_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "expanded_conv_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "expanded_conv_depthwise_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "expanded_conv_project", "class_name": "Conv2D", "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0, {}]]], "config": {"padding": "same", "filters": 16, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "expanded_conv_project", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "expanded_conv_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "expanded_conv_project_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_1_expand", "class_name": "Conv2D", "inbound_nodes": [[["expanded_conv_project_BN", 0, 0, {}]]], "config": {"padding": "same", "filters": 96, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_1_expand", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_1_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_1_expand", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_1_expand_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_1_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_1_expand_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_1_expand_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_1_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["block_1_expand_relu", 0, 0, {}]]], "config": {"name": "block_1_pad", "padding": [[0, 1], [0, 1]], "trainable": false, "dtype": "float32", "data_format": "channels_last"}}, {"name": "block_1_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_1_pad", 0, 0, {}]]], "config": {"padding": "valid", "depth_multiplier": 1, "strides": [2, 2], "use_bias": false, "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_1_depthwise", "activity_regularizer": null, "activation": "linear", "trainable": false, "depthwise_regularizer": null, "depthwise_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "data_format": "channels_last"}}, {"name": "block_1_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_1_depthwise", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_1_depthwise_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_1_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_1_depthwise_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_1_depthwise_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_1_project", "class_name": "Conv2D", "inbound_nodes": [[["block_1_depthwise_relu", 0, 0, {}]]], "config": {"padding": "same", "filters": 24, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_1_project", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_1_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_1_project", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_1_project_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_2_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}]]], "config": {"padding": "same", "filters": 144, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_2_expand", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_2_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_2_expand", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_2_expand_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_2_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_2_expand_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_2_expand_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_2_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_2_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_2_depthwise", "activity_regularizer": null, "activation": "linear", "trainable": false, "depthwise_regularizer": null, "depthwise_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "data_format": "channels_last"}}, {"name": "block_2_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_2_depthwise", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_2_depthwise_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_2_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_2_depthwise_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_2_depthwise_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_2_project", "class_name": "Conv2D", "inbound_nodes": [[["block_2_depthwise_relu", 0, 0, {}]]], "config": {"padding": "same", "filters": 24, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_2_project", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_2_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_2_project", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_2_project_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_2_add", "class_name": "Add", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}], ["block_2_project_BN", 0, 0, {}]]], "config": {"name": "block_2_add", "trainable": false, "dtype": "float32"}}, {"name": "block_3_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_2_add", 0, 0, {}]]], "config": {"padding": "same", "filters": 144, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_3_expand", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_3_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_3_expand", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_3_expand_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_3_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_3_expand_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_3_expand_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_3_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["block_3_expand_relu", 0, 0, {}]]], "config": {"name": "block_3_pad", "padding": [[0, 1], [0, 1]], "trainable": false, "dtype": "float32", "data_format": "channels_last"}}, {"name": "block_3_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_3_pad", 0, 0, {}]]], "config": {"padding": "valid", "depth_multiplier": 1, "strides": [2, 2], "use_bias": false, "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_3_depthwise", "activity_regularizer": null, "activation": "linear", "trainable": false, "depthwise_regularizer": null, "depthwise_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "data_format": "channels_last"}}, {"name": "block_3_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_3_depthwise", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_3_depthwise_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_3_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_3_depthwise_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_3_depthwise_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_3_project", "class_name": "Conv2D", "inbound_nodes": [[["block_3_depthwise_relu", 0, 0, {}]]], "config": {"padding": "same", "filters": 32, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_3_project", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_3_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_3_project", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_3_project_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_4_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}]]], "config": {"padding": "same", "filters": 192, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_4_expand", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_4_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_4_expand", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_4_expand_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_4_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_4_expand_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_4_expand_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_4_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_4_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_4_depthwise", "activity_regularizer": null, "activation": "linear", "trainable": false, "depthwise_regularizer": null, "depthwise_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "data_format": "channels_last"}}, {"name": "block_4_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_4_depthwise", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_4_depthwise_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_4_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_4_depthwise_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_4_depthwise_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_4_project", "class_name": "Conv2D", "inbound_nodes": [[["block_4_depthwise_relu", 0, 0, {}]]], "config": {"padding": "same", "filters": 32, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_4_project", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_4_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_4_project", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_4_project_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_4_add", "class_name": "Add", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}], ["block_4_project_BN", 0, 0, {}]]], "config": {"name": "block_4_add", "trainable": false, "dtype": "float32"}}, {"name": "block_5_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_4_add", 0, 0, {}]]], "config": {"padding": "same", "filters": 192, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_5_expand", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_5_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_5_expand", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_5_expand_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_5_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_5_expand_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_5_expand_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_5_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_5_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_5_depthwise", "activity_regularizer": null, "activation": "linear", "trainable": false, "depthwise_regularizer": null, "depthwise_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "data_format": "channels_last"}}, {"name": "block_5_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_5_depthwise", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_5_depthwise_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_5_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_5_depthwise_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_5_depthwise_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_5_project", "class_name": "Conv2D", "inbound_nodes": [[["block_5_depthwise_relu", 0, 0, {}]]], "config": {"padding": "same", "filters": 32, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_5_project", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_5_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_5_project", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_5_project_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_5_add", "class_name": "Add", "inbound_nodes": [[["block_4_add", 0, 0, {}], ["block_5_project_BN", 0, 0, {}]]], "config": {"name": "block_5_add", "trainable": false, "dtype": "float32"}}, {"name": "block_6_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_5_add", 0, 0, {}]]], "config": {"padding": "same", "filters": 192, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_6_expand", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_6_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_6_expand", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_6_expand_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_6_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_6_expand_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_6_expand_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_6_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["block_6_expand_relu", 0, 0, {}]]], "config": {"name": "block_6_pad", "padding": [[0, 1], [0, 1]], "trainable": false, "dtype": "float32", "data_format": "channels_last"}}, {"name": "block_6_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_6_pad", 0, 0, {}]]], "config": {"padding": "valid", "depth_multiplier": 1, "strides": [2, 2], "use_bias": false, "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_6_depthwise", "activity_regularizer": null, "activation": "linear", "trainable": false, "depthwise_regularizer": null, "depthwise_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "data_format": "channels_last"}}, {"name": "block_6_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_6_depthwise", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_6_depthwise_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_6_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_6_depthwise_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_6_depthwise_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_6_project", "class_name": "Conv2D", "inbound_nodes": [[["block_6_depthwise_relu", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_6_project", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_6_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_6_project", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_6_project_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_7_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}]]], "config": {"padding": "same", "filters": 384, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_7_expand", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_7_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_7_expand", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_7_expand_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_7_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_7_expand_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_7_expand_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_7_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_7_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_7_depthwise", "activity_regularizer": null, "activation": "linear", "trainable": false, "depthwise_regularizer": null, "depthwise_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "data_format": "channels_last"}}, {"name": "block_7_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_7_depthwise", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_7_depthwise_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_7_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_7_depthwise_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_7_depthwise_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_7_project", "class_name": "Conv2D", "inbound_nodes": [[["block_7_depthwise_relu", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_7_project", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_7_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_7_project", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_7_project_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_7_add", "class_name": "Add", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}], ["block_7_project_BN", 0, 0, {}]]], "config": {"name": "block_7_add", "trainable": false, "dtype": "float32"}}, {"name": "block_8_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_7_add", 0, 0, {}]]], "config": {"padding": "same", "filters": 384, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_8_expand", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_8_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_8_expand", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_8_expand_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_8_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_8_expand_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_8_expand_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_8_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_8_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_8_depthwise", "activity_regularizer": null, "activation": "linear", "trainable": false, "depthwise_regularizer": null, "depthwise_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "data_format": "channels_last"}}, {"name": "block_8_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_8_depthwise", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_8_depthwise_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_8_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_8_depthwise_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_8_depthwise_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_8_project", "class_name": "Conv2D", "inbound_nodes": [[["block_8_depthwise_relu", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_8_project", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_8_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_8_project", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_8_project_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_8_add", "class_name": "Add", "inbound_nodes": [[["block_7_add", 0, 0, {}], ["block_8_project_BN", 0, 0, {}]]], "config": {"name": "block_8_add", "trainable": false, "dtype": "float32"}}, {"name": "block_9_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_8_add", 0, 0, {}]]], "config": {"padding": "same", "filters": 384, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_9_expand", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_9_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_9_expand", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_9_expand_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_9_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_9_expand_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_9_expand_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_9_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_9_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_9_depthwise", "activity_regularizer": null, "activation": "linear", "trainable": false, "depthwise_regularizer": null, "depthwise_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "data_format": "channels_last"}}, {"name": "block_9_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_9_depthwise", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_9_depthwise_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_9_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_9_depthwise_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_9_depthwise_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_9_project", "class_name": "Conv2D", "inbound_nodes": [[["block_9_depthwise_relu", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_9_project", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_9_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_9_project", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_9_project_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_9_add", "class_name": "Add", "inbound_nodes": [[["block_8_add", 0, 0, {}], ["block_9_project_BN", 0, 0, {}]]], "config": {"name": "block_9_add", "trainable": false, "dtype": "float32"}}, {"name": "block_10_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_9_add", 0, 0, {}]]], "config": {"padding": "same", "filters": 384, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "name": "block_10_expand", "activity_regularizer": null, "kernel_regularizer": null, "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"name": "block_10_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_10_expand", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_10_expand_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_10_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_10_expand_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_10_expand_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, {"name": "block_10_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_10_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_10_depthwise", "activity_regularizer": null, "activation": "linear", "trainable": false, "depthwise_regularizer": null, "depthwise_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "data_format": "channels_last"}}, {"name": "block_10_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_10_depthwise", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "name": "block_10_depthwise_BN", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "trainable": false, "scale": true, "center": true, "gamma_regularizer": null, "momentum": 0.999, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "block_10_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_10_depthwise_BN", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "block_10_depthwise_relu", "trainable": false, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}}, 